#!/usr/bin/perl

use strict;
use warnings;

=encoding UTF8
=head1 SYNOPSYS

Поиск номера первого ненулевого бита.

=head1 run ($x)

Функция поиска первого ненулевого бита в 32-битном числе (кроме 0).
Пачатает номер первого ненулевого бита в виде "$num\n"

Примеры: 

run(1) - печатает "0\n".

run(4) - печатает "2\n"

run(6) - печатает "1\n"

=cut

sub run {
    my ($x) = @_;
    my $num = 0;
    if (($x & 0xFFFF) == 0) { $num = 16; $x >>= 16; }
    if (($x & 0x00FF) == 0) { $num += 8; $x >>= 8; }
    if (($x & 0x000F) == 0) { $num += 4; $x >>= 4; }
    if (($x & 0x0003) == 0) { $num += 2; $x >>= 2; }
    if (($x & 0x0001) == 0) { $num += 1; }
    # while (~($x - 1) & $x == 0) {
    # 	$num = $num + 1;
    # 	$x = $x >> 1;
    # }
    print "$num\n";
}

1;
